/**
 * //输入字符串的格式为 mark data1——data7,均以空格为间隔,共计8位
 * 输入字符串的格式为 mark data1——data7,均以逗号为间隔,共计8位。abb的strtoval以，识别
 * mark标识机器人应当执行的动作
 * 0:急停及其他指令。
 * 0 0 0 0 0 0 0  全零：急停
 *
 * 1：导入轨迹，且执行关节空间运动.轨迹导入每次导入十个，不足十个则导入
 * 2：导入轨迹，且执行笛卡尔空间直线运动
 * 3：导入轨迹，且执行笛卡尔空间圆弧运动。圆弧运动轨迹需要两条字符串进行确定
 *
 * 6:开始加工
 * 7：暂停加工
 * 8：复位
 * 9：保存加工数据
 *
 * 11：读取当前关节角
 * 12：单点设置目标关节角，后续数字为关节角
 * 13：读取当前位置
 * 14：单点设置目标位置，后续数字位xyz和rqy
 *
 * 21:x-,第二位为1，2，3，表示运动速度为v100，v300，v600
 * 22:x+,第二位为1，2，3，表示运动速度为v100，v300，v600
 * 23:y-,第二位为1，2，3，表示运动速度为v100，v300，v600
 * 24:y+,第二位为1，2，3，表示运动速度为v100，v300，v600
 * 25:z-,第二位为1，2，3，表示运动速度为v100，v300，v600
 * 26:z+,第二位为1，2，3，表示运动速度为v100，v300，v600
 *
 * 轨迹控制中，data1——data7依次标识三维位置坐标和四元数
 * 单点控制中，data1——data6依次标识三维坐标和欧拉角，data7置为mark

 **/
